<!DOCTYPE html>
<html>
<head>
<meta charset="ISO-8859-1">
<title>Digital Business</title>
<nav><h1><span>Zusammenfassung</span><h1></h1></nav>
</head><link href="../css/DigitalBusiness.css" rel="stylesheet">
<body>
<h3>Teil 1</h3>
<p><span class="pt">1. Definieren Sie den Begriff &bdquo;<span class="color">Electronic Business</span>&ldquo;.</span><br><br>
&bull; Vereinbarungen, Transaktionen und Abwicklung von Gesch&auml;ftsprozessen auf elektronischem Weg mit Einsatz der Informationstechnologie und &ouml;ffentlichen und privaten Kommunikationsnetzwerken (z.B. Internet)<br>
&bull; Ziel ist das Erreichen eines Mehrwerts<br><br>
<span class="pt">2. Nennen Sie 5 Aktivit&auml;ts- bzw. Anwendungsbereiche des Electronic Business.
 Geben Sie jeweils ein praktisches Beispiel</span><br><br>
&bull; Physikalische G&uuml;ter z.B. E&ndash;Commerce<br>
&bull; Freizeit z.B. E&ndash;Travel<br>
&bull; Informationsdienste z.B. E&ndash;Publishing<br>
&bull; Finanzdienste z.B. E&ndash;Banking<br>
&bull; Personenbezogene Dienstleistungen z.B. E&ndash;Education<br><br>
<span class="pt">3. Erl&auml;utern Sie den Unterschied zwischen B2B und B2C anhand 4 typischer Merkmalsauspr&auml;gungen.</span></p><br><br> 
<table>
<tr>
<th>Eigenschaften</th>
<th>Erscheinungsform B2B</th>
<th>Erscheinungsform B2C</th>
</tr>
<tr>
<th>Komplexit&auml;t</th>
<td>komplexe Gesch&auml;ftsprozesse</td>
<td>Einfache struktuiert</td>
</tr>
<tr>
<th>Dauer der Geschäftsbeziehung</th>
<td>Langfristige Partnerschaft</td>
<td>Kurzfristige Partnerschaft</td>
</tr>
<tr>
<th>Vorhersagbarkeit</th>
<td>Eher vorhersagbar</td>
<td>Spontan</td>
</tr>
<tr>
<th>Qualifikationen der Teilnehmer</th>
<td>Fachkraft, Experte</td>
<td>Auch Menschen mit geringere bildung</td>
</tr>
</table><br><br>

<p><span class="pt">4. Sogenannte Technologieplattformen des Electronic Business lassen 
sich anhand ihrer prim&auml;ren Zielsetzungen &amp; <span class="color">&bdquo;Einkauf&ldquo;</span>, <span class="color">&bdquo;Verkauf&ldquo;</span>, <span class="color">&bdquo;Handel&ldquo;</span>, <span class="color">&bdquo;Kontakt&ldquo;</span> und <span class="color">&bdquo;Kooperation&ldquo;</span> klassifizieren. Nennen Sie 3 konkrete Technologieplattformen und ordnen Sie ihnen jeweils
 die passende Zielsetzung zu.</span><br><br>
<span class="pt">Kauf, Verkauf, Handel</span><br><br>
&bull;E-Procurement Platforms<br>
Erlektronische Beschaffung von Produkten<br>
&bull;E-Shops<br>
Elektronische Verkauf von Produkten<br>
&bull;E-Marketplaces<br>
Kommerziele Funktionalit&auml;t f&uuml;r Unternehmen und Privatpersonen, Produkte auf elektronischem Weg zu kaufen oder zu verkaufen<br>
<br><span class="pt">Kontakt, Zusammenarbeit</span><br><br>
&bull;E-Community Platforms<br>
Kontakte auf elektronischem Weg kn&uuml;pfen<br>
&bull;E-Companies<br>
Elektronische Zusammenarbeit der Unternehmen &bdquo;um virtuelle Unternehmen&ldquo; zu erzeugen<br><br>
<span class="pt">5. Erl&auml;utern Sie den Begriff &bdquo;Disintermediation&ldquo; und &bdquo;Re-Intermediation&ldquo; anhand eines konkreten Beispiels</span><br><br>
<span class="pt">Disintermediation</span><br>
Verschwinden von traditionelle Vermittler (Bsp.: Verlag verkauft ab sofort online und nicht mehr &uuml;ber Buchhandlung)<br><br>
<span class="pt">Re-intermediation</span><br>
-	beschreibt eine Wiedereinf&uuml;hrung von Zwischenh&auml;ndlern z.B. traditionelle Einzelhandelskan&auml;len<br><br>
<span class="pt">6.Erl&auml;utern Sie den Unterschied zwischen einem vertikalen und einem horizontalen elektronischen Marktplatz. Geben Sie je ein praktisches Beispiel </span>
<br><br><span class="pt">horizontaler Marktplatz</span><br>
Handelt sich um sektor&uuml;bergreifende Angebote, d.h. keine Spezialisierung auf Produktlinien<br>
Eher Spezialisierung auf spezielle Produktgruppen <br>
Bsp.: B&uuml;rozubeh&ouml;r, Computer

<br><br><span class="pt">Vertikaler Marktplatz</span><br><br><br>
Spezialisierung auf spezielle Linien im Wirtschafts- oder Industriesektor<br>
Angeboten werden handelsspezifische Produkte und DL<br>
Bsp.: Automobilindustrie </p><br>
<h3>Teil 2</h3>
<p><span class="pt">1.Nennen Sie die vier Abstraktionsebenen des TCP/IP Modells und beschreiben Sie ihre wesentlichen Aufgaben. Nennen Sie jeweils ein konkretes Protokoll oder einen Standard pro Abstraktionsebene. 
Anwendungsbereich</span> <br><br>
&ndash;		Bereitstellung von Diensten direkt zu Anwendungsprogrammen z.B. HTTP<br>
Transportebene<br>
&ndash;		Bietet zuverl&auml;ssige End-to-End-Kommunikationsdienste z.B. TCP <br>
Internetebene<br>
&ndash;		bietet Paketversand und Routing z.B. IPv4<br>
Verbindungsebene<br>
&ndash;		Erm&ouml;glicht den Zugriff auf zugrundeliegende Kommunikationsnetze z.B. Ethernet<br><br>
<span class="pt">2. Nennen und beschreiben Sie in kurzen Stichworten die drei Komponenten, aus denen das Domain Name System (DNS) besteht.</span><br><br>
Domain Name Space:<br>
&ndash;		Beantwortet die Anfragen zur Namensaufl&ouml;sung.<br>
 
Name Servers:<br>
&ndash;		Softwareprogramm zur Bearbeitung von Namensraumanforderungen<br>

Resolvers<br> 
&ndash;		Softwareprogramm, das Anfragen an den Name Server stellt<br><br>

<span class="pt">3. Beschreiben Sie das grundlegende Kommunikationsmodell der E-Mail- &Uuml;bertragung und nennen Sie die dabei zum Einsatz kommenden Protokolle </span><br><br>
SMTP (Simple Mail Transfer Protocol):<br>
	1) Initiierung durch Mail User Agent (MUA) und Verbindung &uuml;ber zum Mail Submission Agent (MSA)<br>
	2) Mail&uuml;bertragung an Empf&auml;nger per Mail Transfer Agent (MTA)<br>
	3) Zustellung der Mail an Mail Box des Empf&auml;ngers per Mail Delivery Agent (MDA)<br>
	4) Nachrichtabruf per MUA des Empf&auml;ngers<br>
&ndash;	 Herunterladen mit POP<br>
&ndash;	 Zugriff mit IMAP<br><br>
	<span class="pt">4. Nennen Sie vier Anwendungstypen, die das Web 2.0 kennzeichnen. Geben Sie jeweils ein praktisches Beispiel und nennen Sie das damit verbundene Gesch&auml;ftskonzept
	 und Erl&ouml;smodell.</span><br><br>
	
SaaS (Software as a Service)<br>
&ndash;		Praktisches Beispiel Ger&auml;teunabh&auml;ngige Dienstplattformen z.B. Cloud<br>
&ndash;		BC Content<br>
&ndash;		EM Aufnahmegeb&uuml;hr, (Pay per Use) Transaktionsgeb&uuml;hr<br>
		
Web Blog<br>
&ndash;		Praktisches Beispiel IT-Forum<br>
&ndash;		BC Content<br>
&ndash;		EM Aufnahmegeb&uuml;hr, Werbung<br>

Social Software<br>
&ndash;		Praktisches Beispiel Facebook<br>
&ndash;		BC: Communication<br>
&ndash;		EM: Werbung, Daten sammeln<br>

Social Bookmarks<br>
&ndash;		Praktisches Beispiel delicious<br>
&ndash;		BC Context <br>
&ndash;		EM Werbung<br>
Wikis<br>
&ndash;	Praktisches Beispiel: Wikipedia<br>
&ndash;		BC: Content<br>
&ndash;	 EM: Spende</p><br>
<h3>Teil 2.2</h3>
<p><span class="pt">1. Nennen Sie die 3 grundlegenden Architekturkomponenten eines Softwaresystems.</span><br><br>
Business Process Architecture<br>
&ndash;		Zeigt die Gesch&auml;ftsprozesse und Informationsfl&uuml;sse<br>

Application Architecture<br>
&ndash;		Zeigt die Komposition und Struktur der Software an, die die Gesch&auml;ftsprozesse unterst&uuml;tzen<br>

Technology Architecture<br>
&ndash;		Zeigt technologische Element f&uuml;r die Installation und den Betrieb der IT<br><br>

<span class="pt">2. Nennen Sie die Schichten einer &bdquo;4-SchichtenClient/Server Architektur&ldquo; 
f&uuml;r Web Anwendungen und beschreiben Sie kurz die wesentlichen Aufgaben dieser Schichten.</span> <br><br>

&ndash;		Presentation Layer (Web Client): Sichtbare Ebene<br>
&ndash;		Presentation Layer (Web Server): Firewall &amp; Load Balancing<br>
&ndash;		Application Layer: Ebene des Anwendungsservers<br>
&ndash;		Database Layer: Ebene des Datenbankservers<br><br>
<span class="pt">3. Nennen und beschreiben Sie 4 Merkmale, die eine Service-orientierte Architektur kennzeichnen. <br><br>
S&auml;ulen:</span><br><br>
Destribution (Verteilt)<br>
&ndash;		SOA eignet sich f&uuml;r verteilte Umgebungen <br>
Loose Coupling (Lose Kopplung)<br>
&ndash;		Loose Kopplung der Dienste<br>
&ndash;		Dienste werden von Anwendungen oder anderen Dienste bei Bedarf dynamisch gesucht, gefunden und eingebunden<br>
Service Repository (Verzeichnisdienst)<br>
&ndash;		Die zur Verf&uuml;gung stehenden Dienste sind samt Daten in der Repository registriert und gespeichert<br>
&ndash;		Die Repository vereinfacht die Suche nach Diensten<br>
Process Orientation (Prozessorientiert)<br>
&ndash;		 Merkmal der SOA ist die Orientierung der Services nach Prozessen<br>
Fundament:<br>
&ndash;		Einfachheit<br>
&ndash;		Sicherheit<br>
&ndash;		Standardisierung<br><br>
<span class="pt">4. Was versteht man unter Cloud-Computing? Welche 3 technischen Ebenen des 
Cloud-Computings werden i.d.R. unterschieden?</span><br><br>
Cloud Computing<br>
Bereitstellung von Services und L&ouml;sungen &uuml;ber das Internet <br>
	Basiert gew&ouml;hnlich auf einen pay-per-use-Business Modell <br>
		Hauptfeatures sind Virtualisierung und Skalierbarkeit (dynamisch)<br> 

Gemeinsame Schichten von Cloud-Computing<br>
SaaS (Software as a Service) <br>
&ndash;		Application software z.B. Salesforce.com<br>
PaaS (Platform as a Service) <br>
&ndash;		Development platform z.B. Force.com<br>
IaaS (Infrastructure as a Service) <br>
&ndash;		Virtual server z.B. Amazon S3</p><br><br>
<h3>Teil 2.3</h3>
<p><span class="pt">1. Erl&auml;utern Sie das CAP-Theorem und zeigen Sie die Bedeutung f&uuml;r die Konzeption von E-Business L&ouml;sungen auf.</span><br><br>
besagt, dass in einem verteilten System nur 2 der 3 Eigenschaften gleichzeitig realisiert werden k&ouml;nnen. Alle 3 gleichzeitig ist unm&ouml;glich.
<br><br>


<span class="pt">Eigenschaften:</span><br>
Consistency  Konsistenz der verteilten Daten<br>
Availability    Verf&uuml;gbarkeit im Sinne akzeptabler Antwortzeit<br>
Partition Tolerance  Ausfalltoleranz des Netzwerks<br><br>

<span class="pt">Einfluss des CAP-Theorem auf eBusiness L&ouml;sungen:</span><br><br>
&bull;CA  (Relationale Datenbanken)<br>
&ndash;Pr&auml;vention durch Vermeidung von Ausf&auml;llen<br>
&ndash;Nicht realistisch f&uuml;r eBusiness L&ouml;sungen mit Verteilten Anwendungssystemen<br><br>

&bull;CP (Banking-Anwendungen)<br>
&ndash;		Verzicht auf Verf&uuml;gbarkeit f&uuml;r die Ausfalltoleranz<br><br>
&bull;AP (DNS, Cloud-Computing)<br>
&ndash;		Verzicht auf Konsistenz f&uuml;r Ausfalltoleranz<br>
&ndash;		Auswahl zwischen CP und AP f&uuml;r den idealen Kompromiss<br><br>

<span class="pt">2. Erl&auml;utern Sie das Grundkonzept eines sog. AP-Systems und geben Sie ein praktisches Einsatzbeispiel f&uuml;r ein solches System<br><br>
	BASE (Basically Available, Soft State, Eventually Consistent)</span><br><br>
&ndash;		F&uuml;r den Zeitraum der Netzwerkst&ouml;rung findet die Transaktionen auf beiden Systemen statt da
 die Verf&uuml;gbarkeit die h&ouml;chste Priorit&auml;t hat und Konsistenz nur zweitrangig ist<br>
&ndash;		Gleich nach Ende des Ausfalls wird die Konsistenz der Daten auf beiden Systemen sichergestellt<br>
&ndash;		Praktisches Einsatzbeispiel: Online Shop<br><br>
<span class="pt">3. Erl&auml;utern Sie das Grundkonzept eines sog. CP-Systems
 und geben Sie ein praktisches Einsatzbeispiel f&uuml;r ein solches System</span><br><br> 
&ndash;		F&uuml;r den Zeitraum Netzwerkst&ouml;rung sind Transaktionen nicht m&ouml;glich da die Konsistenz die h&ouml;chste Priorit&auml;t hat und die Priorit&auml;t nur zweitrangig ist<br>
&ndash;		Praktisches Einsatzbeispiel: Online Banking</p><br>
<h3>Teil 2.4</h3>
<p><span class="pt">1. Was bedeutet Auto ID und welche Technologien werden darunter subsumiert?</span><br><br>
Technologien zur Identifizierung, Datenerfassung, Datenerhebung &amp; Daten&uuml;bertragung<br>
&ndash;	Technologien:<br>
	&rarr;Biometrics<br>
	&rarr;Barcode<br>
&rarr; Chip Cards<br>
 &rarr;Radio Frequency Identification (RFID)<br>
	&rarr;Optical Character Recognition (OCR)<br><br>
	<span class="pt">2. Wof&uml;r steht die Abk&uuml;rzung GTIN? 
	Wie ist der Aufbau der Datenstruktur und welche Nummern k&ouml;nnen damit harmonisiert werden?</span><br><br>	
&ndash;	Identifikationsnummer, mit der Produkte/Packst&uuml;cke eindeutig identifiziert werden k&ouml;nnen<br>
&ndash;	EAN.UCC Standards k&ouml;nnen zur einzigartigen Identifikation von Waren harmonisiert werden <br>
&ndash;	Aufbau: 14-stellig, rein numerisch, hat f&uuml;hrende Nullen, wenn eine Nummer weniger als 14 Stellen hat<br><br>

 <span class="pt">3. Nennen Sie die wesentlichen Komponenten, aus denen ein RFID System besteht und beschreiben Sie kurz deren Funktion 
RFID</span><br><br>
&ndash;	Radio Frequency Identification<br>

RFID Middleware:<br> 
&ndash;	Datenaufbereitung, Anbindung an Applikationssysteme<br> 

RFID Reader: <br>
&ndash;	Lese Schreibger&auml;t und Antenne zur Identifikation und Lokalisierung von Objekten<br> 

RFID Tag: <br>
&ndash;		Datentr&auml;ger<br>

Interface to Reader: <br>
&ndash;		Daten&uuml;bertragung zur RFID Middleware<br>

Air interface: <br>
&ndash;		Kontaktlose Daten&uuml;bertragung mit Funk&uml;bertragung<br><br> 

<span class="pt">4. Nennen Sie 4 B2B Nachrichtenstandards und charakterisieren Sie diese Standards
 anhand der beiden Merkmale &bdquo;Geltungsbereich&ldquo; und &bdquo;Branchenbezug&ldquo;.</span></p><br><br>
 
 <table>
<tr>
<th>B2B Nachrichtenstandards</th>
<th>Geltungsbereich</th>
<th>Branchenbezug</th>
</tr>
<tr>
<th>UN/EDIFACT</th>
<td>International &amp; branchen&uuml;bergreifend</td>
<td>Handel &amp; Transport</td>
</tr>
<tr>
<th>ANSI ASC X12</th>
<td>National &amp; branchen&uuml;bergreifend</td>
<td>Eletrischer Datenaustausch</td>
</tr>
<tr>
<th>SWIFT</th>
<td>Internantional &amp; branchenspezifisch</td>
<td>Finanzwesen</td>
</tr>
<tr>
<th>RosettaNet</th>
<td>International &amp; branchenspezifisch</td>
<td>High-Tech Industrie</td>
</tr>
</table>

<h3>Teil 3</h3>
<p><span class="pt">1. Nennen und erl&auml;utern Sie 4 wesentliche Sicherheitsanforderungen an einen elektronischen Datenaustausch zwischen zwei Kommunikationspartnern und geben
 sie jeweils ein Beispiel f&uuml;r einen geeigneten Sicherheitsmaßnahmen</span><br><br>
-	Identifikation u. Authentifikation des Senders und der Herkunft der Daten, z.B. durch Login vor Datenaustausch<br>
-	Vertraulichkeit der Daten w&auml;hrend Datenaustausch z.B. durch eine Verschl&auml;sselung <br>
-	Sicherstellung der Dateiintegrit&auml;t z.B. durch Digitale Signatur<br>
-	Sicherstellen der Unwiderrufbarkeit der Daten&uuml;bertragung z.B. durch Integrit&auml;tssicherung<br><br>

<span class="pt">2. Was wird unter einer Spoofing Attacke verstanden und welche g&auml;ngigen Spoofing Typen gibt es?</span><br><br>
-	Situation, in der eine Person oder ein Programm sich als etwas anderes ausgibt<br>
-	Typen: IP-Spoofing, Web Spoofing, DNS Spoofing<br><br>

<span class="pt">3.</span><br><br>
Phishing<br> 
Versucht an vertrauensw&uuml;rdige Daten zukommen, in dem man sich<br>
 z. B. als vertrauensw&uuml;rdige Website ausgibt (Banking, etc.) <br>

Pharming <br>
Versuch, den Traffic einer Webseite illegal auf eine andere umzuleiten (per DNS- Manipulation oder so) <br><br>
 

<span class="pt">4. Erl&auml;utern Sie das Grundprinzip der hybriden Verschl&uuml;sselung und nennen Sie die wesentlichen <span>Vorteile</span> dieses Verfahrens.<br><br>
 Welche Schl&uuml;ssel kommen bei diesem Verfahren zum Einsatz?</span><br><br>
-	Zuf&auml;llig Generierung von Session Keys f&uuml;r jeden Kommunikationsprozess<br>
-	Symmetrische Verschl&uuml;sselung der Kommunikations-Daten mit dem Session-Key <br>
-	Asymmetrische Verschl&uuml;sselung des Session-Keys mit dem &ouml;ffentlich. Schl&uuml;ssel des Empf&auml;ngers<br> 

Vorteil<br>
Verbindet die Vorteile symmetrischer und asymmetrischer Verschl&uuml;sselungsmethoden<br>
Schneller Ansatz mit hohem Grad an Sicherheit<br>
Schl&uuml;ssel<br>
-	Session Key, Public Key of Recipient, Private Key of Recipient<br><br>

<span class="pt">5. Welche Zielsetzung hat eine digitale Signatur? Erl&auml;utern Sie das Grundprinzip und nennen Sie die zum Einsatz kommenden Schl&uuml;ssel</span><br><br>
Grundprinzip<br>
-	Pr&uuml;fsumme, die mit dem elektronischen Dokument wie eine echte Signatur wirkt <br>
Ziel<br>
-	beweisen, dass das Dokument nicht von Unbefugten ver&auml;ndert wurde <br>
Schl&uuml;ssel<br>
-	Private Key of Sender, Public Key of Sender<br><br>
<span>6.</span><br><br>

Ein digitales Zertifikat ist ein elektronischer Echtheitsnachweis,
der die Identit&auml;t einer Person, eines Rechners oder einer Organisation bescheinigt. Im realen Leben kann ein Zertifikat mit
einem Personalausweis verglichen werden. 
Anhand der Angaben in dem Personalausweis kann die Identit&auml;t einer Person festgestellt werden</p><br><br>
<h3>Teil 4</h3> 
<p><span class="pt">1. Nennen Sie 5 Herausforderungen bzw. technische Beschr&auml;nkungen, mit denen Mobile Business derzeit konfrontiert ist</span><br><br>
-	&Uuml;bertragungsst&ouml;rungen<br>
-	Energieverbrauch<br>
-	Unzureichende Bandbreite<br>
-	Langsame Prozessoren<br>
-	Kleiner Arbeitsspeicher<br>
<br>

<span class="pt">2. Wie viele Generationen von Mobilfunknetzen werden bislang unterschieden? Nennen Sie pro Generation ein konkretes Mobilfunknetz oder einen damit verbundenen Mobilfunkstandard.</span><br><br>
&ndash;	Es werden 4 Generationen von Mobilfunkstandards unterschieden<br>
1. Generation &rarr; C-Net<br>
2. Generation &rarr; GPRS<br>
3. Generation &rarr; UMTS<br>
4. Generation &rarr; LTE<br><br>

<span class="pt">3. Nennen Sie 5 Kategorien mobiler Anwendungen und geben Sie jeweils ein Beispiel.</span><br><br>
&ndash;	Informations- und Kommunikationsanwendungen z.B. Webbrowser
&ndash;	Multimedia-Anwendungen z.B. Videospieler
&ndash;	Office-Anwendungen z.B. Kalender
&ndash;	Reise- und Navigationsanwendungen z.B. Maps
&ndash;	Bank-/Finanzierungsantr&auml;ge z.B. online Banking<br><br>

<span class="pt">4. Nennen und erl&auml;utern Sie die vierwesentlichen Charakteristika,
 die das sogenannte Ubiquitous Computing auszeichnen und geben Sie jeweils ein praktisches Beispiel</span><br><br>

<span class="color">Allgegenw&auml;rtigkeit (Ubiquity / Pervasiveness)</span><br><br>
&ndash; Hohe Anzahl an Rechenger&auml;ten<br>
	&ndash; Oft mobil oder eingebettet in der Umwelt z.B. Ger&auml;te<br>
<span class="color">Unsichtbarkeit (Invisibility)</span><br><br>
	&ndash; H&auml;ufig verschwindet die Schnittstelle zwischen dem Benutzer und dem Ger&auml;t und das Ger&auml;t wird unsichtbar<br>
	&ndash; Zugriff und Kontrolle durch andere Ger&auml;te wie Smartphones <br>
<span class="color">Vernetztheit (Connectedness)</span><br><br>
&ndash; Ger&auml;te sind mit anderen Ger&auml;ten und Informationen vernetzt<br>
&ndash; Verwenden von drahtlosen und drahtgebundenen Netzwerktechnologien z.B. WLAN<br>
<span class="color">Kontext-Sensitivit&auml;t (Context-awareness)</span><br><br>
&ndash; bietet eine intelligente Br&uuml;cke zwischen rechnerisches Umfeld und reale Welt<br>
&ndash; Unter Verwendung von Sensor- und Identifikationstechnologien (z. B. RFID, GPS)</p>

	

</body>
</html>